Revit 2024 API
EnergyAnalysisConstruction Class
 Represent an analytical construction as a composite of layered materials.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class EnergyAnalysisConstruction : Element
Visual Basic
Public Class EnergyAnalysisConstruction _
	Inherits Element
Visual C++
public ref class EnergyAnalysisConstruction : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
See Also
EnergyAnalysisConstruction Members
Autodesk.Revit.DB.Analysis Namespace